[
  {
    "id": "1",
    "name": "Chef John",
    "picture": "https://images.unsplash.com/photo-1583394293214-28ded15ee548?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=580&q=80",
    "bio": "Chef John is a British chef, restaurateur, and television personality. He has owned and operated a series of restaurants since he was 31, with 16 Michelin stars in total. Ramsay is known for presenting TV shows about competitive cookery and food, such as the British series Hell's Kitchen, The F Word, and Ramsay's Kitchen Nightmares, along with the American versions of Hell's Kitchen, Kitchen Nightmares, MasterChef, MasterChef Junior, and Hotel Hell.",
    "likes": 500,
    "totalRecipes":"50",
    "recipes": [
      {
        "id": "1",
        "name": "Beef Wellington",
        "picture": "https://www.gordonramsay.com/assets/Beef-Wellington.jpg",
        "ingredients": [
          "2 lb beef tenderloin",
          "1 tbsp olive oil",
          "1 tsp dried thyme",
          "8 oz mushrooms",
          "2 tbsp dijon mustard",
          "1 sheet puff pastry",
          "1 egg yolk"
        ],
        "method": "1. Preheat oven to 425 degrees F. Season the beef with salt, pepper, and thyme.\n2. Heat olive oil in a large skillet over high heat. Add beef and sear on all sides until browned.\n3. Remove beef from skillet and let cool. Meanwhile, finely chop mushrooms and saute in same skillet until they release their liquid and it evaporates.\n4. Season with salt and pepper, then remove from heat and let cool.\n5. Brush the beef with mustard and cover with mushrooms.\n6. Roll out puff pastry and place beef in the center. Fold pastry over beef and seal edges.\n7. Place beef Wellington on a baking sheet and brush with egg yolk.\n8. Bake for 40-45 minutes or until pastry is golden brown.",
        "rating": 4.5,
        "favorite": false
      },
      {
        "id": "2",
        "name": "Lamb Rack with Herb Crust",
        "picture": "https://images.unsplash.com/photo-1583130879770-ebd1cadc5d47?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1yZWxhdGVkfDIwfHx8ZW58MHx8fHw%3D&auto=format&fit=crop&w=500&q=60",
        "ingredients": [
          "2 racks of lamb",
          "2 cloves garlic, minced",
          "1/4 cup fresh parsley, chopped",
          "1/4 cup fresh thyme, chopped",
          "1/4 cup fresh breadcrumbs",
          "1/4 cup dijon mustard",
          "2 tbsp olive oil",
          "Salt and pepper to taste"
        ],
        "method": "1. Preheat oven to 375°F.\n2. Season lamb racks with salt and pepper.\n3. Heat olive oil in a large skillet over medium-high heat. Sear lamb racks for 3-4 minutes on each side, until golden brown.\n4. In a small bowl, combine garlic, parsley, thyme, breadcrumbs, and dijon mustard. Mix well.\n5. Spread the herb mixture over the lamb racks.\n6. Roast lamb racks in the oven for 15-20 minutes, until cooked to your liking. Let rest for 5 minutes before slicing."
      },
      {
        "id": "3",
        "name": "Sticky Toffee Pudding",
        "picture": "https://images.unsplash.com/photo-1607631568010-a87245c0daf8?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1yZWxhdGVkfDZ8fHxlbnwwfHx8fA%3D%3D&auto=format&fit=crop&w=500&q=60",
        "ingredients": [
          "1 cup pitted dates, chopped",
          "1 cup boiling water",
          "1 tsp baking soda",
          "1/2 cup unsalted butter, softened",
          "1 cup brown sugar",
          "2 eggs",
          "1 3/4 cups all-purpose flour",
          "1 tsp baking powder",
          "1/4 tsp salt",
          "1/2 cup heavy cream",
          "1/4 cup unsalted butter",
          "1 cup brown sugar",
          "1/2 cup golden syrup"
        ],
        "method": "1. Preheat oven to 350°F.\n2. In a medium bowl, combine chopped dates, boiling water, and baking soda. Let stand for 10 minutes.\n3. In a large bowl, cream softened butter and brown sugar together until light and fluffy.\n4. Beat in eggs one at a time.\n5. In a separate bowl, sift together flour, baking powder, and salt. Add to the creamed mixture and mix well.\n6. Fold in the date mixture.\n7. Pour batter into a greased 9x13-inch baking dish. Bake for 30-35 minutes, until a toothpick inserted in the center comes out clean.\n8. In a small saucepan, combine heavy cream, unsalted butter, brown sugar, and golden syrup. Cook over medium heat, stirring constantly, until mixture comes to a boil. Reduce heat and simmer for 5-10 minutes, until slightly thickened.\n9. Pour sauce over warm pudding and serve."
      }
    ],
    "experience": 32
  },
  {
    "id": "2",
    "name": "Chef Jane",
    "picture": "https://images.unsplash.com/photo-1583130879770-ebd1cadc5d47?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1yZWxhdGVkfDIwfHx8ZW58MHx8fHw%3D&auto=format&fit=crop&w=500&q=60",
    "bio": "Chef Jane is a British chef and restaurateur. He is known for his approachable cuisine, which has led him to front numerous television shows and open many restaurants. Oliver's restaurants include Jamie's Italian, Chef Jane's Diner, and Barbecoa. He has written over 20 cookbooks and won several awards, including the 2010 TED Prize.",
    "likes": 300,
    "totalRecipes":"30",
    "recipes": [
      {
        "id": "1",
        "name": "Roast Chicken",
        "picture": "https://www.jamieoliver.com/recipes/chicken-recipes/easy-roast-chicken/",
        "ingredients": [
          "1 whole chicken",
          "1 lemon",
          "4 sprigs of fresh thyme",
          "4 cloves of garlic",
          "1 onion",
          "2 tbsp olive oil",
          "Salt and pepper"
        ],
        "method": "Preheat the oven to 200°C (400°F/Gas 6). Remove the chicken from the fridge and let it sit at room temperature for 30 minutes. Meanwhile, halve the lemon and place it inside the chicken along with the thyme and 2 of the garlic cloves. Cut the onion into wedges and place it in the roasting tin. Drizzle the onion with olive oil and season with salt and pepper. Place the chicken on top of the onion and garlic in the roasting tin. Drizzle the chicken with olive oil and season with salt and pepper. Roast the chicken in the preheated oven for 1 hour and 20 minutes, or until the juices run clear when the thickest part of the chicken is pierced with a skewer. Remove the chicken from the oven and let it rest for 10 minutes before carving.",
        "rating": 4.5,
        "favorite": false
      },
      {
        "id": "2",
        "name": "Spaghetti Carbonara",
        "picture": "https://www.jamieoliver.com/recipes/pasta-recipes/easy-carbonara/",
        "ingredients": [
          "400 g spaghetti",
          "4 large free-range egg yolks",
          "100 g Pecorino cheese",
          "4 slices of higher-welfare pancetta",
          "1 clove of garlic",
          "Olive oil"
        ],
        "method": "Bring a large pan of salted water to the boil and cook the spaghetti according to the packet instructions. Meanwhile, finely grate the Pecorino cheese and beat the egg yolks in a bowl. Finely slice the pancetta and peel and finely chop the garlic. Fry the pancetta in a large frying pan over a medium-high heat until crispy and golden, then add the garlic and fry for another minute. Remove the pan from the heat. When the spaghetti is cooked, drain it in a colander, reserving a cupful of the cooking water. Add the spaghetti to the frying pan with the pancetta and garlic, tossing well over the heat so it's coated with the lovely flavours. Remove the pan from the heat, pour in the beaten egg yolks and cheese, and toss together quickly. Add a splash of cooking water to loosen, if needed. Taste, season with black pepper, and divide between bowls.",
        "rating": 4.8,
        "favorite": false
      },
      {
        "id": "2",
        "name": "Jamie's Italian Meatballs",
        "picture": "https://www.jamieoliver.com/recipes/meat-recipes/jamie-s-classic-meatballs-pasta/",
        "ingredients": [
          "1 lb ground beef",
          "1/2 cup breadcrumbs",
          "1/2 cup grated parmesan cheese",
          "1/2 cup chopped fresh parsley",
          "1/2 tsp garlic powder",
          "1/2 tsp onion powder",
          "1/4 tsp salt",
          "1/4 tsp black pepper",
          "1 large egg"
        ],
        "method": [
          "Preheat the oven to 375°F.",
          "In a large bowl, combine the ground beef, breadcrumbs, parmesan cheese, parsley, garlic powder, onion powder, salt, pepper, and egg.",
          "Mix until well combined, then form into meatballs.",
          "Place the meatballs on a baking sheet and bake for 20-25 minutes, or until cooked through.",
          "Serve with your favorite pasta and tomato sauce."
        ],
        "rating": 4.8,
        "favorite": false
      }
    ]
  },
  {
    "id": "3",
    "name": "Chef Michael",
    "picture": "https://images.unsplash.com/photo-1607631568010-a87245c0daf8?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1yZWxhdGVkfDZ8fHxlbnwwfHx8fA%3D%3D&auto=format&fit=crop&w=500&q=60",
    "bio": "Chef Michael is an English food writer and television cook. She is best known for her love of home cooking and comfort food. She has written numerous cookbooks and hosted several television shows, including Nigella Bites and Nigellissima. In addition to her work in the food industry, Lawson is also a journalist and a judge on the reality show The Taste.",
    "likes": 800,
    "totalRecipes":"80",
    "recipes": [
      {
        "id": "1",
        "name": "Chocolate Brownies",
        "picture": "https://www.nigella.com/assets/uploads/recipes/5/760x507/chocolate-brownies-horizontal.jpg",
        "ingredients": [
          "1 1/2 sticks unsalted butter",
          "3/4 cup cocoa powder",
          "1 1/2 cups granulated sugar",
          "3 large eggs",
          "1 1/2 teaspoons vanilla extract",
          "1/2 cup all-purpose flour",
          "1/2 teaspoon salt",
          "1 cup chopped walnuts (optional)"
        ],
        "method": "Preheat the oven to 350°F. Melt the butter in a large saucepan. Add the cocoa and stir until smooth. Remove from the heat and let cool slightly. Add the sugar and mix well. Add the eggs one at a time, stirring well after each addition. Stir in the vanilla. Add the flour and salt and mix well. Stir in the nuts, if using. Pour the batter into a greased 9x13-inch baking dish. Bake for 20-25 minutes, or until a toothpick inserted in the center comes out clean. Let cool before cutting into squares.",
        "rating": 4.8,
        "favorite": false
      },
      {
        "id": "2",
        "name": "Linguine with Clams",
        "picture": "https://www.nigella.com/assets/uploads/recipes/5/linguine-with-clams-horizontal.jpg",
        "ingredients": [
          "1 pound linguine",
          "2 pounds small clams",
          "1/2 cup dry white wine",
          "1/2 cup water",
          "2 garlic cloves, minced",
          "1/4 cup chopped parsley",
          "1/4 teaspoon red pepper flakes",
          "3 tablespoons unsalted butter",
          "3 tablespoons olive oil"
        ],
        "method": "Cook the linguine according to the package instructions. Meanwhile, rinse the clams under cold water and discard any that are open. In a large saucepan, combine the wine, water, garlic, parsley, and red pepper flakes. Bring to a boil over medium-high heat. Add the clams, cover, and cook for 5-7 minutes, or until the clams open. Discard any clams that do not open. Remove from heat and stir in the butter and olive oil. Drain the linguine and add it to the clam mixture. Toss to combine and serve immediately.",
        "rating": 4.6,
        "favorite": false
      },
      {
        "id": "3",
        "name": "Spaghetti Carbonara",
        "picture": "https://www.giallozafferano.com/images/245-24594/Spaghetti-carbonara_780x520.jpg",
        "ingredients": [
          "1 lb spaghetti",
          "6 oz pancetta or bacon, diced",
          "4 large eggs",
          "1 cup grated Pecorino Romano cheese",
          "1/2 tsp black pepper",
          "1/4 tsp salt",
          "1/4 cup chopped fresh parsley (optional)"
        ],
        "method": "Cook the spaghetti in a large pot of salted boiling water until al dente. While the pasta cooks, cook the pancetta or bacon in a large skillet over medium heat until crisp. In a bowl, whisk together the eggs, Pecorino Romano cheese, black pepper, and salt. Drain the cooked spaghetti and reserve 1 cup of the pasta water. Add the spaghetti to the skillet with the cooked pancetta and toss well. Remove the skillet from heat and pour the egg mixture over the spaghetti, stirring quickly until the eggs are cooked and the spaghetti is coated in a creamy sauce. If the sauce is too thick, add a little bit of the reserved pasta water. Serve hot, garnished with chopped parsley if desired.",
        "rating": 4.7,
        "favorite": false
      }
    ]
  },
  {
    "id": "4",
    "name": "Chef Sarah",
    "picture": "https://images.unsplash.com/photo-1595273670150-bd0c3c392e46?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1yZWxhdGVkfDV8fHxlbnwwfHx8fA%3D%3D&auto=format&fit=crop&w=500&q=60",
    "bio": "Chef Sarah is a British chef, restaurateur, writer, and television personality. He has owned and operated a number of highly acclaimed restaurants around the world, and has starred in several television shows, including Hell's Kitchen, MasterChef, and Kitchen Nightmares. Ramsay is known for his no-nonsense approach to cooking and his high standards for quality and flavor.",
    "likes": 50000,
    "totalRecipes":"20",
    "recipes": [
      {
        "id": "1",
        "name": "Beef Wellington",
        "picture": "https://www.gordonramsayrestaurants.com/wp-content/uploads/2019/12/beef-wellington-hero-1024x576.jpg",
        "ingredients": [
          "1 1/2 pound beef tenderloin",
          "1 tablespoon olive oil",
          "1 teaspoon mustard powder",
          "1 teaspoon thyme leaves",
          "1 teaspoon chopped rosemary",
          "1/2 teaspoon salt",
          "1/2 teaspoon black pepper",
          "1/2 cup chopped mushrooms",
          "2 tablespoons unsalted butter",
          "1/4 cup finely chopped shallots",
          "2 cloves garlic, minced",
          "1/4 cup chopped parsley",
          "1/2 cup red wine",
          "1 sheet puff pastry",
          "1 egg, beaten"
        ],
        "method": "Preheat the oven to 400°F. Rub the beef tenderloin with olive oil and season with mustard powder, thyme, rosemary, salt, and black pepper. Heat a skillet over high heat and sear the beef until browned on all sides. Remove from the skillet and let cool. In the same skillet, cook the mushrooms in butter until soft. Add shallots, garlic, parsley, and red wine, and cook until the liquid has reduced by half. Roll out the puff pastry and place the beef in the center. Spoon the mushroom mixture on top. Fold the pastry over and seal the edges. Brush with the beaten egg. Bake for 25-30 minutes, or until the pastry is golden brown and the beef is cooked to your desired doneness. Let rest for 10 minutes before slicing and serving.",
        "rating": 4.9,
        "favorite": true
      },
      {
        "id": "2",
        "name": "Lemon Herb Roasted Chicken",
        "picture": "https://www.gordonramsayrestaurants.com/wp-content/uploads/2019/05/lemon-herb-chicken-hero-1024x576.jpg",
        "ingredients": [
          "1 whole chicken",
          "1 lemon, sliced",
          "1/4 cup olive oil",
          "2 garlic cloves, minced",
          "2 teaspoons chopped fresh thyme",
          "2 teaspoons chopped fresh rosemary",
          "1 teaspoon salt",
          "1/2 teaspoon black pepper",
          "1/4 cup chopped parsley"
        ],
        "method": "Preheat the oven to 400°F. Rinse the chicken and pat dry with paper towels. Stuff the cavity with lemon slices. In a small bowl, mix together olive oil, garlic, thyme, rosemary, salt, and black pepper. Rub the mixture all over the chicken, making sure to coat it well. Place the chicken on a roasting pan and roast for 1 hour and 15 minutes, or until the internal temperature of the thickest part of the chicken reaches 165°F",
        "rating": 4.2,
        "favorite": true
      },
      {
        "id": "4",
        "name": "Spaghetti Carbonara",
        "picture": "https://www.delonghi.com/Global/recipes/multifry/pasta/Spaghetti_with_Carbonara_Sauce.jpg",
        "ingredients": [
          "1 pound spaghetti",
          "6 slices of bacon, chopped",
          "4 eggs",
          "1 cup grated Parmesan cheese",
          "2 cloves garlic, minced",
          "1/4 teaspoon salt",
          "1/4 teaspoon black pepper"
        ],
        "method": "Cook the spaghetti according to package instructions until al dente. Meanwhile, in a large skillet over medium heat, cook the bacon until crispy. Remove from the pan and set aside. In a bowl, whisk together the eggs, Parmesan cheese, garlic, salt, and black pepper. Drain the spaghetti and reserve 1/4 cup of the cooking water. Add the spaghetti to the skillet with the bacon and toss to combine. Remove the skillet from the heat and pour the egg mixture over the spaghetti, tossing quickly to coat the pasta evenly. If the pasta seems dry, add some of the reserved cooking water to loosen the sauce. Serve immediately.",
        "rating": 4.5,
        "favorite": false
      }
    ]
  },
  {
    "id": "5",
    "name": "Chef David",
    "picture": "https://media.istockphoto.com/id/690840558/photo/confident-female-chef-holding-cooked-food-in-kitchen.jpg?s=170667a&w=0&k=20&c=sBgbn-XP4jBp2ryn2u4ZOGFhE9idVkxv5VNLiTD-zhs=",
    "bio": "Chef David is a British chef and television personality. He is known for his focus on healthy, fresh ingredients and his efforts to improve the quality of school meals in the UK. Oliver has written numerous cookbooks and hosted several television shows, including The Naked Chef, Jamie's Kitchen, and Chef David's Food Revolution. In addition to his work in the food industry, he is also an advocate for various social and environmental causes.",
    "likes": 700,
    "totalRecipes":"70",
    "recipes": [
      {
        "id": "1",
        "name": "Roast Chicken with Lemon and Rosemary",
        "picture": "https://www.jamieoliver.com/recipes/chicken-recipes/roast-chicken-with-lemon-rosemary/",
        "ingredients": [
          "1 whole chicken",
          "2 lemons, zested",
          "2 garlic cloves, crushed",
          "2 tablespoons fresh rosemary, chopped",
          "1 tablespoon olive oil",
          "Sea salt and freshly ground black pepper"
        ],
        "method": "Preheat your oven to 190°C/375°F/gas 5. Put the chicken in a roasting tray. Mix together the lemon zest, garlic, rosemary and olive oil and season with salt and freshly ground black pepper. Spread the mixture over the chicken and into the cavity. Roast the chicken for 1 hour and 20 minutes, basting every 20 minutes, or until the juices run clear when you pierce the thickest part of the leg with a skewer. When the chicken is cooked, transfer it to a board and leave it to rest for 10 minutes before carving.",
        "rating": 4.5,
        "favorite": true
      },
      {
        "id": "2",
        "name": "Pesto Pasta",
        "picture": "https://www.jamieoliver.com/recipes/pasta-recipes/pasta-pesto/",
        "ingredients": [
          "400g dried spaghetti",
          "200g green beans, trimmed",
          "1 medium potato",
          "4 tablespoons pesto",
          "1 tablespoon extra virgin olive oil",
          "Sea salt and freshly ground black pepper",
          "Parmesan cheese, grated, to serve"
        ],
        "method": "Bring a large pan of salted water to the boil and add the spaghetti. After 5 minutes, add the green beans and potato to the same pan. Cook for 10 minutes until everything is cooked, then drain and tip back into the pan. Add the pesto and olive oil to the pan and mix well, seasoning with salt and freshly ground black pepper to taste. Serve with grated Parmesan cheese.",
        "rating": 4.2,
        "favorite": false
      },
      {
        "id": "4",
        "name": "Mushroom Risotto",
        "picture": "https://www.delish.com/uk/cooking/recipes/a31085232/easy-mushroom-risotto-recipe/",
        "ingredients": [
          "1 litre chicken or vegetable stock",
          "2 tbsp olive oil",
          "1 onion, finely chopped",
          "2 garlic cloves, crushed",
          "300g risotto rice",
          "150ml white wine",
          "250g mushrooms, sliced",
          "50g butter",
          "50g grated parmesan cheese",
          "Salt and black pepper, to taste"
        ],
        "method": "Heat the stock in a saucepan and keep it simmering. Heat the oil in a large, heavy-based saucepan and fry the onion and garlic over a low heat until soft. Add the rice and stir well to coat in the oil. Increase the heat to medium and add the wine, stirring until it has been absorbed. Add a ladleful of hot stock and stir until it has been absorbed. Keep adding the stock, a ladleful at a time, stirring constantly and waiting for each addition to be absorbed before adding the next. After about 15-20 minutes, when the rice is tender but still has a little bite, stir in the mushrooms and cook for a further 3-4 minutes. Stir in the butter and Parmesan cheese and season with salt and black pepper to taste. Serve hot.",
        "rating": 4.8,
        "favorite": true
      }
    ]
  },
  {
    "id": "6",
    "name": "Chef Anna",
    "picture": "https://images.unsplash.com/photo-1592498546551-222538011a27?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1yZWxhdGVkfDF8fHxlbnwwfHx8fA%3D%3D&auto=format&fit=crop&w=500&q=60",
    "bio": "Chef David is a British chef and television personality. He is known for his focus on healthy, fresh ingredients and his efforts to improve the quality of school meals in the UK. Oliver has written numerous cookbooks and hosted several television shows, including The Naked Chef, Jamie's Kitchen, and Chef David's Food Revolution. In addition to his work in the food industry, he is also an advocate for various social and environmental causes.",
    "likes": 400,
    "totalRecipes":"40",
    "recipes": [
      {
        "id": "1",
        "name": "Roast Chicken with Lemon and Rosemary",
        "picture": "https://www.jamieoliver.com/recipes/chicken-recipes/roast-chicken-with-lemon-rosemary/",
        "ingredients": [
          "1 whole chicken",
          "2 lemons, zested",
          "2 garlic cloves, crushed",
          "2 tablespoons fresh rosemary, chopped",
          "1 tablespoon olive oil",
          "Sea salt and freshly ground black pepper"
        ],
        "method": "Preheat your oven to 190°C/375°F/gas 5. Put the chicken in a roasting tray. Mix together the lemon zest, garlic, rosemary and olive oil and season with salt and freshly ground black pepper. Spread the mixture over the chicken and into the cavity. Roast the chicken for 1 hour and 20 minutes, basting every 20 minutes, or until the juices run clear when you pierce the thickest part of the leg with a skewer. When the chicken is cooked, transfer it to a board and leave it to rest for 10 minutes before carving.",
        "rating": 4.5,
        "favorite": true
      },
      {
        "id": "2",
        "name": "Pesto Pasta",
        "picture": "https://www.jamieoliver.com/recipes/pasta-recipes/pasta-pesto/",
        "ingredients": [
          "400g dried spaghetti",
          "200g green beans, trimmed",
          "1 medium potato",
          "4 tablespoons pesto",
          "1 tablespoon extra virgin olive oil",
          "Sea salt and freshly ground black pepper",
          "Parmesan cheese, grated, to serve"
        ],
        "method": "Bring a large pan of salted water to the boil and add the spaghetti. After 5 minutes, add the green beans and potato to the same pan. Cook for 10 minutes until everything is cooked, then drain and tip back into the pan. Add the pesto and olive oil to the pan and mix well, seasoning with salt and freshly ground black pepper to taste. Serve with grated Parmesan cheese.",
        "rating": 4.2,
        "favorite": false
      },
      {
        "id": "4",
        "name": "Mushroom Risotto",
        "picture": "https://www.delish.com/uk/cooking/recipes/a31085232/easy-mushroom-risotto-recipe/",
        "ingredients": [
          "1 litre chicken or vegetable stock",
          "2 tbsp olive oil",
          "1 onion, finely chopped",
          "2 garlic cloves, crushed",
          "300g risotto rice",
          "150ml white wine",
          "250g mushrooms, sliced",
          "50g butter",
          "50g grated parmesan cheese",
          "Salt and black pepper, to taste"
        ],
        "method": "Heat the stock in a saucepan and keep it simmering. Heat the oil in a large, heavy-based saucepan and fry the onion and garlic over a low heat until soft. Add the rice and stir well to coat in the oil. Increase the heat to medium and add the wine, stirring until it has been absorbed. Add a ladleful of hot stock and stir until it has been absorbed. Keep adding the stock, a ladleful at a time, stirring constantly and waiting for each addition to be absorbed before adding the next. After about 15-20 minutes, when the rice is tender but still has a little bite, stir in the mushrooms and cook for a further 3-4 minutes. Stir in the butter and Parmesan cheese and season with salt and black pepper to taste. Serve hot.",
        "rating": 4.8,
        "favorite": true
      }
    ]
  }
]
